---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedLoadAreas
source: html/9c991fd0-6c19-dcca-6bce-a5e9b180838d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomNotEnclosedLoadAreas Property

[Room] is not in a properly enclosed region

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotEnclosedLoadAreas { get; }
```